# Chegou a hora de testar os conhecimentos desenvolvidos durante a aula.

Você é responsável por criar um banco de dados local de clientes para uma instituição financeira. Temos o arquivo CSV com os dados de clientes.

## Sua missão é:

- Criar o banco de dados local com a biblioteca SQLAlchemy.
- Escrever os dados do arquivo CSV neste banco de dados local.
- Realizar três atualizações no banco de dados:
- Atualizar o registro do cliente de ID 6840104 que teve o rendimento anual alterado para 300000.
- Excluir o registro do cliente de ID 5008809, pois essa pessoa não possui mais conta na instituição financeira.
- Criar um novo registro de cliente seguindo as especificações abaixo

| Campo | Valor |
|-------|-------|
| **ID_Cliente** | 6850985 |
| **Idade** | 33 |
| **Grau_escolaridade** | Doutorado |
| **Estado_civil** | Solteiro |
| **Tamanho_familia** | 1 |
| **Categoria_de_renda** | Empregado |
| **Ocupacao** | TI |
| **Anos_empregado** | 2 |
| **Rendimento_anual** | 290000 |
| **Tem_carro** | 0 |
| **Moradia** | Casa/apartamento próprio |

In [13]:
from sqlalchemy import create_engine, MetaData, Table, inspect, text
import pandas as pd
import os

caminho = os.path.join('..', 'data', 'clientes_banco.csv')
engine = create_engine('sqlite:///:memory:')

dados = pd.read_csv(caminho)
dados.head()

,ID_Cliente,Idade,Grau_escolaridade,Estado_civil,Tamanho_familia,Categoria_de_renda,Ocupacao,Anos_empregado,Rendimento_anual,Tem_carro,Moradia
0,5008804,32,Ensino superior,União-estável,2,Empregado,Outro,12,427500.0,1,Apartamento alugado
1,5008805,32,Ensino superior,União-estável,2,Empregado,Outro,12,427500.0,1,Apartamento alugado
2,5008806,58,Ensino médio,Casado,2,Empregado,Segurança,3,112500.0,1,Casa/apartamento próprio
3,5008808,52,Ensino médio,Solteiro,1,Associado comercial,Vendas,8,270000.0,0,Casa/apartamento próprio
4,5008809,52,Ensino médio,Solteiro,1,Associado comercial,Vendas,8,270000.0,0,Casa/apartamento próprio

In [14]:
dados.to_sql('clientes', engine, index=False)

438463

In [15]:
inspector = inspect(engine)

print(inspector.get_table_names())

['clientes']

In [16]:
# Atualizar o registro do cliente de ID 6840104 que teve o rendimento anual alterado para 300000.
query = 'UPDATE clientes SET Rendimento_anual = 300000 WHERE ID_Cliente = 6840104'

with engine.connect() as conn:
    result = conn.execute(text(query))
    conn.commit()

In [17]:
# Excluir o registro do cliente de ID 5008809, pois essa pessoa não possui mais conta na instituição financeira.
query = 'DELETE FROM clientes WHERE ID_Cliente = 5008809'

with engine.connect() as conn:
    result = conn.execute(text(query))
    conn.commit()

In [18]:
# - Criar um novo registro de cliente seguindo as especificações abaixo
"""| Campo | Valor |
|-------|-------|
| **ID_Cliente** | 6850985 |
| **Idade** | 33 |
| **Grau_escolaridade** | Doutorado |
| **Estado_civil** | Solteiro |
| **Tamanho_familia** | 1 |
| **Categoria_de_renda** | Empregado |
| **Ocupacao** | TI |
| **Anos_empregado** | 2 |
| **Rendimento_anual** | 290000 |
| **Tem_carro** | 0 |
| **Moradia** | Casa/apartamento próprio |"""

query = 'INSERT INTO clientes (ID_Cliente, Idade, Grau_escolaridade, Estado_civil, ' \
        'Tamanho_familia, Categoria_de_renda, Ocupacao, Anos_empregado, ' \
        'Rendimento_anual, Tem_carro, Moradia) ' \
        'VALUES (6850985, 33, "Doutorado", "Solteiro", 1, "Empregado", "TI", ' \
        '2, 290000, 0, "Casa/apartamento próprio")'

with engine.connect() as conn:
    result = conn.execute(text(query))
    conn.commit()

In [23]:
pd.read_sql_query('SELECT * FROM clientes WHERE ID_Cliente = 6850985', engine)

,ID_Cliente,Idade,Grau_escolaridade,Estado_civil,Tamanho_familia,Categoria_de_renda,Ocupacao,Anos_empregado,Rendimento_anual,Tem_carro,Moradia
0,6850985,33,Doutorado,Solteiro,1,Empregado,TI,2,290000.0,0,Casa/apartamento próprio